# IdeaStatiCa.RcsApi.Model.ReinforcedCrossSection

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Name** | **string** |  | [optional]
**CrossSection** | **ReferenceElement** |  | [optional]
**Bars** | **List&lt;ReinforcedBar&gt;** |  | [optional]
**Stirrups** | **List&lt;Stirrup&gt;** |  | [optional]
**TendonBars** | **List&lt;TendonBar&gt;** |  | [optional]
**TendonDucts** | **List&lt;TendonDuct&gt;** |  | [optional]
**Id** | **int** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)